Repository: common-repository/wp-cookies-enabler
Catalog: languages/wpce-*.po
Languages: it_it

source: Save Settings
it_it: Salva le Impostazioni

source: Reset to Default
it_it: Ripristinare i valori iniziali

source: General Settings
it_it: Impostazioni Generali

source: Class names
it_it: Nomi delle Classi

source: Script Class
it_it: Classe Script

source: Add this class and type="text/plain" to every script tag that installs cookies
it_it: Aggiungere questa classe e type="text/plain" ad ogni tag script che installa cookie

source: Iframe Class
it_it: Classe Iframe

source: Add this class and change the src attribute to data-ce-src to every iframe tag that installs cookies
it_it: Aggiungere questa classe e cambiare l'attributo src in data-ce-src ad ogni tag iframe che installa cookie

source: Accept Class
it_it: Classe Accettazione

source: Add this class to any element to make it act as an accept button, enabling the cookies on click.
it_it: Aggiungere questa classe ad un qualsiasi elemento per renderlo un pulsante di accettazione che abilita i cookie al click.

source: Dismiss Class
it_it: Classe Rifiuto

source: Add this class to any element to make it act as a dismiss button, removing the notice banner on click.
it_it: Aggiungere questa classe ad un qualsiasi elemento per renderlo un pulsante di rifiuto che rimuove il banner al click.

source: Disable Class
it_it: Classe Disabilitazione

source: Add this class to any element to make it act as a disable button, removing the notice banner and disabling cookies on click.
it_it: Aggiungere questa classe ad un qualsiasi elemento per renderlo un pulsante di disabilitazione rimuovendo il banner e disabilitando i cookie al click.

source: Banner settings
it_it: Impostazione Banner

source: Banner Class
it_it: Classe Banner

source: This is the class of the banner element that will be created.
it_it: Questa è la classe del banner che verrà creato.

source: Banner HTML
it_it: HTML Banner

source: Insert the banner content here and give the correct classes to accept, disable and dismiss elements.
it_it: Inserire qui il contenuto del banner ed assegnare agli elementi le corrette classi di accettazione, rifiuto e disabilitazione.

source: This website uses cookies. <a href="#" class="ce-accept">Enable Cookies</a>
it_it: Questo sito utilizza i cookie. <a href="#" class="ce-accept">Abilita i Cookie</a>

source: Consent options
it_it: Opzioni di consenso

source: Scroll to consent
it_it: Scorrere per consentire

source: This option will enable cookies when the user scrolls a certain amount in any direction.
it_it: Questa opzione abiliterà i cookie quando l'utente scorrerà la pagina di un certo quantitativo in qualsiasi direzione.

source: Scroll Offset
it_it: Offset di scorrimento

source: The height to scroll in pixels.
it_it: L'altezza da scorrere in pixel.

source: Click to consent
it_it: Cliccare per consentire

source: This option will enable cookies when the user clicks on any element on the page that doesn't belong to the notice banner or other script-created elements.
it_it: Questa opzione abiliterà i cookie quando l'utente cliccherà un qualsiasi elemento che non appartiene al banner o ad altri elementi creati da script.

source: Cookie settings
it_it: Impostazione del Cookie

source: Cookie name
it_it: Nome del Cookie

source: This is the name of the cookie that is created by this plugin to store the user preference.
it_it: Questo è il nome del cookie creato da questo plugin per memorizzare la preferenza dell'utente.

source: Cookie duration
it_it: Durata del cookie

source: In days.
it_it: In giorni.

source: Iframe settings
it_it: Impostazioni Iframe

source: Iframe placeholder
it_it: Sostitutuzione iframe

source: A custom placeholder for blocked iframes will be inserted after the hidden iframe element.
it_it: Facendo così, verrà inserito un elemento sostitutivo personalizzato dopo l'iframe ora nascosto e bloccato.

source: Iframes Placeholder Class
it_it: Classe dell'elemento sostitutivo dell'iframe

source: This is the class of the placeholder element that will be created.
it_it: Questa è la classe dell'elemento sostitutivo che verrà creato.

source: Placeholder HTML
it_it: HTML sostitutivo

source: Insert the placeholder content here and give the correct classes to accept, disable and dismiss elements.
it_it: Inserire qui il contenuto dell'elemento sostitutivo ed assegnare agli elementi le corrette classi di accettazione, rifiuto e disabilitazione.

source: This content is not available without cookies. <a href="#" class="ce-accept">Enable Cookies</a>
it_it: Questo contenuto non è disponibile senza l'utilizzo dei cookie. <a href="#" class="ce-accept">Abilita i Cookie</a>

source: Aspect
it_it: Aspetto

source: Banner position
it_it: Posizione del Banner

source: Position your banner at the top or at the bottom of your page.
it_it: Posiziona il banner in cima o in fondo alla pagina.

source: Text color
it_it: Colore del Testo

source: Text color. Default #ffffff
it_it: Colore del testo. Default #ffffff

source: Banner background
it_it: Sfondo del Banner

source: Banner background color. Default #222222
it_it: Sfondo del Banner. Default #222222

source: Other customizations
it_it: Altre personalizzazioni

source: You can further customize the aspect of the banner and his text by using the visual editor in the General Settings tab or typing directly custom CSS code.
it_it: È possibile personalizzare ulteriormente l'aspetto del banner e del testo usando l'editor visuale nel tab relativo alle Impostazioni Generali oppure inserendo direttamente del codice CSS personalizzato.

source: Custom CSS
it_it: CSS personalizzato

source: Type in your custom CSS code. Use class names you specified in General Settings.
it_it: Inserire qui il codice CSS personalizzato. Usare le stesse classi definite nelle Impostazioni Generali.

source: What's New
it_it: Novità

source: Documentation
it_it: Documentazione

source: Credits
it_it: Riconoscimenti

source: WP Cookies Enabler is an easy and lightweight solution to preventively block third-party cookies installed by js and to comply with the EU cookie law.
it_it: WP Cookies Enabler è una soluzione semplice e leggera per bloccare preventivamente i cookie di terze parti installati da javascript, osservando così la legge sui cookie Europea.

source: Version %s
it_it: Versione %s

source: Go to Settings
it_it: Vai alle Impostazioni

source: Info
it_it: Informazioni

source: Project Leader
it_it: Responsabili del Progetto

source: Development Leader
it_it: Responsabile dello Sviluppo

source: External libraries
it_it: Librerie esterne

source: This plugin uses some external libraries to accomplish some of his goals.
it_it: Questo plugin utilizza alcune librerie esterne per raggiungere alcuni dei propri obiettivi.

source: by
it_it: di

source: as the cookie-blocking engine
it_it: come motore blocca cookie

source: to defer synchronous scripts
it_it: per posporre gli scripr sincroni

source: for the custom CSS editor
it_it: per l'editor CSS

source: for custom metaboxes in the settings page
it_it: per i custom metabox nella pagina delle impostazioni

source: WP Cookies Enabler will not block cookies out of the box. Even though the banner is displayed, you still have to put your hands on the code to actually stop cookies. Here it is what you have to do.
it_it: WP Cookies Enabler non blocca automaticamente i cookie. Nonostante il banner venga visualizzato, sarà necessario sporcarsi le mani con il codice per fermare effettivamente l'installazione dei cookie. Ecco come si deve fare.

source: Blocking cookies from script tags
it_it: Bloccare i cookie provenienti da tag script

source: Add the class <code>"ce-script"</code> and <code>type="text/plain"</code> to every script tag that installs cookies
it_it: Aggiungere la classe <code>"ce-script"</code> e <code>type="text/plain"</code> ad ogni tag script che installa cookie

source: Blocking cookies from iframes
it_it: Bloccare i cookie provenienti da iframe

source: For <code>iframes</code>, change the <code>src</code> attribute to <code>data-ce-src</code> and add the class <code>"ce-iframe"</code>
it_it: Per quanto riguarda gli <code>iframes</code>, cambiare l'attributo <code>src</code> in <code>data-ce-src</code> e aggiungere la classe <code>"ce-iframe"</code>

source: iframe placeholder
it_it: Sostitutuzione iframe

source: You can enable placeholders for blocked iframes using the related option in the <a href="%s">General Settings</a> page.
it_it: È possibile abilitare la sostitutuzione degli iframe bloccati usando la relativa opzione nella pagina delle <a href="%s">Impostazioni Generali</a>.

source: Doing so, a custom placeholder for blocked iframes will be inserted after the hidden <code>iframe</code> element.
it_it: Facendo così, verrà inserito un sostituto personalizzato dopo l'<code>iframe</code> ora nascosto e bloccato.

source: You can customize the placeholder HTML using his relative text editor in the Settings page.
it_it: Si può personalizzare il codice HTML dell'elemento sostitutivo usando il relativo editor di testo nella pagina delle Impostazioni.

source: Problematic scripts
it_it: Script problematici

source: Some scripts use <code>document.write</code> and can't be executed asynchronusly. This plugin load Postscribe to defer the loading of these script without blocking the page.
it_it: Alcuni script usano <code>document.write</code> e non possono essere eseguiti in modo asincrono. Questo plugin usa Postscribe per posporre il caricamento di questi script senza bloccare la pagina.

source: Just change the <code>src</code> to <code>data-ce-src</code> and add the class <code>ce-script</code>.
it_it: Cambiare semplicemente l'attributo <code>src</code> in <code>data-ce-src</code> e aggiungere la classe <code>ce-script</code>.

source: Adding the <code>ce-accept</code> class to any element will make it act as an accept button, enabling the cookies on click.
it_it: Aggiungendo la classe <code>ce-accept</code> ad un qualsiasi elemento lo farà agire come un pulsante di accettazione, abilitando i cookie in seguito al click.

source: Adding the <code>ce-dismiss</code> class to any element will make it act as a dismiss button, removing the notice banner on click.
it_it: Aggiungendo la classe <code>ce-dismiss</code> ad un qualsiasi elemento lo farà agire come un pulsante di rifiuto, rimuovendo il banner in seguito al click.

source: Adding the <code>ce-disable</code> class to any element will make it act as a disable button, removing the notice banner and disabling cookies on click.
it_it: Aggiungendo la classe <code>ce-disable</code> ad un qualsiasi elemento lo farà agire come un pulsante di disabilitazione, rimuovendo il banner e disabilitando i cookie in seguito al click.

source: COOKIE LOVES YOU!
it_it: I COOKIE TI VOGLIONO BENE!

source: EU legislation on cookies
it_it: Legislazione Europea riguardo ai cookie

source: EUROPEAN websites must follow the Commission's guidelines on <a href="%s" target="blank">privacy and data protection</a> and inform users that cookies are not being used to gather information unnecessarily.
it_it: I siti EUROPEI devono seguire le linee guida della Commissione su <a href="%s" target="blank">privacy e protezione dei dati</a> e informare gli utenti che i cookie non vengono utilizzati per raccogliere informazioni al di là di quelle strettamente necessarie.

source: The <a href="%s" target="blank">ePrivacy directive</a> – more specifically Article 5(3) – requires prior informed consent for storage or for access to information stored on a user's terminal equipment. In other words, you must ask users if they agree to most cookies and similar technologies before the site starts to use them.
it_it: La <a href="%s" target="blank">direttiva sulla privacy in rete</a> – più specificatamente l'Articolo 5(3) – richiede un consenso informato preventivo per la memorizzazione o l'accesso ad informazioni contenute nel terminale dell'utente. In altre parole, si deve chiedere all'utente se è d'accordo sull'utilizzo dei cookie e di tecnologie simili prima che il sito stesso inizi ad usarle.

source: For <strong>consent</strong> to be valid, it must be <strong>informed</strong>, <strong>specific</strong>, <strong>freely given</strong> and must constitute a real indication of the individual's wishes.
it_it: Affinché il <strong>consenso</strong> sia valido, esso deve essere <strong>informato</strong>, <strong>preciso</strong>, <strong>dato liberamente</strong> e deve costituire una reale indicazione del proprio volere.

source: Block cookies from script tags...
it_it: Blocca i cookie provenienti dai tag script...

source: Prevent javascript from installing cookies through <code>&lt;script&gt;</code> tags, ie Google Analytics.
it_it: Impedisce a javascript di installare i cookie attraverso i tag <code>&lt;script&gt;</code>, per esempio quelli di Google Analytics.

source: ... iframes...
it_it: ... iframe...

source: Prevent iframes that could install cookies from being loaded, ie Google Maps.
it_it: Impedisce il caricamento ad iframe che potrebbero installare cookie, come per esempio Google Maps.

source: ... and also problematic scripts
it_it: ... e anche da script problematici

source: Some scripts use <code>document.write</code> and can't be executed asynchronusly. Thanks to Postscribe it is possible to defer the loading of these script without blocking the page.
it_it: Alcuni script usano <code>document.write</code> e non possono essere eseguiti in maniera asincrona. Grazie a Postscribe è possibile posporre il caricamento di questi script senza bloccare la pagina.

source: First release
it_it: Release iniziale
